# -*- coding: utf-8 -*-
""""1 Практическая работаГОТОВАЯ.ipynb"

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1qoOd_rgoiQ9qJhzr074XAKklw8F6FBGj
"""

a = 2
b = 12

a + b

price = 500
discount = 0.2

final_price = price * (1 - discount)

print(final_price)

500 * (1 - 0.2)

price = input('Введите цену товара')
discount = input('Введите размер скидки')

discount_float = float(discount)
price_float = float(price)

final_price = price_float * (1 - discount_float)
print('Финальная цена товара:', final_price)

print(price)

"""# Easy tasks

Напишите фрагмент кода на Python, который предлагает пользователю ввести свой рост и присваивает введенное пользователем значение переменной с именем height.
"""

height = input("Введите рост")

"""Напишите фрагмент кода Python, который предлагает пользователю ввести свой люби­мый цвет и присваивает введенное пользователем значение переменной с именем color.


"""

colour = input("Введите любимый цвет")

"""Напишите инструкции присваивания, которые выполняют приведенные ниже операции
с переменными a и b:

а) прибавляет 2 к a и присваивает результат b; 

б) умножает b на 4 и присваивает результат a; 

в) делит а на 3.14 и присваивает результат b; 

г) вычитает 8 из b и присваивает результат a.
"""

a = 3
b = 10
print(b)
b = a + 2
print(b)
a = b * 4 
print(a)
b = a / 3.14
print(b)
a = b - 8
print(a)

"""Допустим, что переменная sales ссылается на вещественное значение. Напишите инст­рукцию, которая показывает значение, округленное до двух десятичных знаков после точки."""

sales = 273.23523
sales_float = float(sales)
print("{0:,.2f}".format (sales))

"""# More tasks

**Расход бензина в расчете на километры пройденного пути.** Расход бензина в расчете на километры пройденного автомобилем пути можно вычислить на основе формулы:

расход = пройденные километры / расход бензина в литрах.

Напишите программу, которая запрашивает у пользователя число пройденных километ­ ров и расход бензина в литрах. Она должна рассчитать расход бензина автомобилем и показать результат.
"""

a = input("Расход бензина в литрах")
b = input("Километры")

a_float = float(a)
b_float = float(b)

c = b_float / a_float
print("Расход бензина", c)

"""**Чаевые, налоr и общая сумма**. Напишите программу, которая вычисляет общую стои­ мость еды в ресторане. Программа должна попросить пользователя ввести стоимость еды, вычислить размер 18-процентных чаевых и 7-процентного налога с продаж и пока­зать все стоимости и итоговую сумму."""

a = input("Стоимость еды неучёт")

a_float = float(a)

b = a_float / 100
c = b * 18
d = b * 7
e = a_float + c + d
print("Чаевые", c ,"Налог" , d ,"Общ сумма" , e)

"""**Преобразователь температуры по шкале Цельсия в температуру по шкале Фарен­гейта**. Напишите программу, которая преобразует показания температуры по шкале Цельсия в температуру по шкале Фаренгейта. Программа должна попросить пользователя ввести температуру по шкале Цельсия и по­ казать температуру, преобразованную в шкалу Фаренгейта."""

f = 33.8
с = input("Гр Цельсия")

a_float = float(a)
f_float = float(f)

a = c * f_float
print("Гр фаренгейта", a)

"""**Регулятор ингредиентов**. Рецепт булочек предусматривает ингредиенты:
* 1.5 стакана сахара; 
* 1 стакан масла; 
* 2.75 стакана муки.

С таким количеством ингредиентов этот рецепт позволяет приготовить 48 булочек. Напишите программу, которая запрашивает у пользователя, сколько булочек он хочет приготовить, и затем показывает число стаканов каждого ингредиента, необходимого для заданного количества булочек.
"""

s = 1.5 / 48
o = 1 / 48
m = 2.75 / 48
b = input("Кол во булок")

b_float = float(b)

f = b_float * s
d = b_float * o
e = b_float * m
print("Сахар" ,f ,"Масло" , d, "Мука" ,e)

"""**Процент учащихся обоего пола**. Напишите программу, которая запрашивает у пользо­ вателя количество учащихся мужского и женского пола, зарегистрированных в учебной группе. Программа должна показать процент учащихся мужского и женского пола."""

m = input("Муж")
f = input("Жен")

m_float = float(m)
f_float = float(f)

a = (m_float + f_float) 
b = 100 / a
c = b * m_float
d = b * f_float
print("Муж", с , "жен" , d)